; domain
(define (domain Dungeon)

    (:requirements
        :typing
        :negative-preconditions
        :conditional-effects
        :equality
    )

    (:types
        location colour key corridor
    )

    (:constants
        red yellow green purple rainbow - colour
    )

    (:predicates

        (hero-at ?loc - location)
        (in ?k - key ?loc - location)

        (connected ?loc - location ?cor - corridor)
        (risky ?cor - corridor)
        (locked ?cor - corridor ?col - colour)

        (arm-free)
        (holding ?k - key)

        (key-colour ?k - key ?col - colour)
        (two-use ?k - key)
        (one-use ?k - key)
        (no-use ?k - key)

        (messy ?loc - location)

    )

    ;Hero can move if the
    ;    - hero is at current location ?from,
    ;    - wants to move to location ?to,
    ;    - corridor ?cor exists between the ?from and ?to locations
    ;    - there isn't a locked door in corridor ?cor
    ;Effects move the hero, and collapse the corridor + make destination "messy" if it's "risky"
    (:action move
        :parameters (?from ?to - location ?cor - corridor)
        :precondition (and
                            (connected ?from ?cor)
                            (connected ?to ?cor)
                            (hero-at ?from)
                            (not (= ?from ?to))

                            (forall (?col - colour) (not (locked ?cor ?col)))

        )
        :effect (and
                            (hero-at ?to)
                            (not (hero-at ?from))

                            (when (risky ?cor)
                                (and (messy ?to)
                                     (not (connected ?from ?cor))
                                     (not (connected ?to ?cor))))
                )
    )

    ;Hero can pick up a key if the
    ;    - hero is at current location ?loc,
    ;    - there is a key ?k at location ?loc,
    ;    - the hero's arm is free,
    ;    - the location is not messy
    ;Effect will have the hero holding the key and their arm no longer being free
    (:action pick-up
        :parameters (?loc - location ?k - key)
        :precondition (and
            (hero-at ?loc)
            (in ?k ?loc)
            (arm-free)
            (not (messy ?loc))
        )
        :effect (and
            (holding ?k)
            (not (in ?k ?loc))
            (not (arm-free))
        )
    )

    ;Hero can drop a key if the
    ;    - hero is holding a key ?k,
    ;    - the hero is at location ?loc
    ;Effect will be that the hero is no longer holding the key
    (:action drop
        :parameters (?loc - location ?k - key)
        :precondition (and
            (holding ?k)
            (hero-at ?loc)
        )
        :effect (and
            (not (holding ?k))
            (in ?k ?loc)
            (arm-free)
        )
    )


    ;Hero can use a key for a corridor if
    ;    - the hero is holding a key ?k,
    ;    - the key still has some uses left,
    ;    - the corridor ?cor is locked with colour ?col,
    ;    - the key ?k is if the right colour ?col,
    ;    - the hero is at location ?loc
    ;    - the corridor is connected to the location ?loc
    ;Effect will be that the corridor is unlocked and the key usage will be updated if necessary
    (:action unlock
        :parameters (?loc - location ?cor - corridor ?col - colour ?k - key)
        :precondition (and
            (locked ?cor ?col)
            (holding ?k)
            (key-colour ?k ?col)
            (hero-at ?loc)
            (connected ?loc ?cor)
            (not (no-use ?k))
        )
        :effect (and
            (not (locked ?cor ?col))
            (when (two-use ?k) (and (not (two-use ?k)) (one-use ?k)))
            (when (one-use ?k) (and (not (one-use ?k)) (no-use ?k)))
        )
    )

    ;Hero can clean a location if
    ;    - the hero is at location ?loc,
    ;    - the location is messy
    ;Effect will be that the location is no longer messy
    (:action clean
        :parameters (?loc - location)
        :precondition (and (hero-at ?loc) (messy ?loc))
        :effect (and (not (messy ?loc)))
    )




)

; problem
(define (problem p3-dungeon)
  (:domain Dungeon)
  (:objects
    loc-3-4 loc-4-5 loc-1-2 loc-2-2 loc-3-2 loc-3-3 loc-2-5 loc-1-3 loc-2-1 loc-1-4 loc-3-5 loc-2-4 loc-4-4 loc-2-3 loc-4-3 - location
    c2122 c1222 c2232 c1213 c1223 c2223 c3223 c3233 c1323 c2333 c1314 c2314 c2324 c2334 c3334 c1424 c2434 c2425 c2535 c3545 c4544 c4443 - corridor
    key1 key2 key3 key4 key5 key6 - key
  )

  (:init

    (hero-at loc-2-1)

    (connected loc-2-1 c2122)
    (connected loc-2-2 c2122)
    (connected loc-1-2 c1222)
    (connected loc-2-2 c1222)
    (connected loc-2-2 c2232)
    (connected loc-3-2 c2232)
    (connected loc-1-2 c1213)
    (connected loc-1-3 c1213)
    (connected loc-1-2 c1223)
    (connected loc-2-3 c1223)
    (connected loc-2-2 c2223)
    (connected loc-2-3 c2223)
    (connected loc-3-2 c3223)
    (connected loc-2-3 c3223)
    (connected loc-3-2 c3233)
    (connected loc-3-3 c3233)
    (connected loc-1-3 c1323)
    (connected loc-2-3 c1323)
    (connected loc-2-3 c2333)
    (connected loc-3-3 c2333)
    (connected loc-1-3 c1314)
    (connected loc-1-4 c1314)
    (connected loc-2-3 c2314)
    (connected loc-1-4 c2314)
    (connected loc-2-3 c2324)
    (connected loc-2-4 c2324)
    (connected loc-2-3 c2334)
    (connected loc-3-4 c2334)
    (connected loc-3-3 c3334)
    (connected loc-3-4 c3334)
    (connected loc-1-4 c1424)
    (connected loc-2-4 c1424)
    (connected loc-2-4 c2434)
    (connected loc-3-4 c2434)
    (connected loc-2-4 c2425)
    (connected loc-2-5 c2425)
    (connected loc-2-5 c2535)
    (connected loc-3-5 c2535)
    (connected loc-3-5 c3545)
    (connected loc-4-5 c3545)
    (connected loc-4-5 c4544)
    (connected loc-4-4 c4544)
    (connected loc-4-4 c4443)
    (connected loc-4-3 c4443)

    (in key1 loc-2-1)
    (in key2 loc-2-3)
    (in key3 loc-2-3)
    (in key4 loc-2-3)
    (in key5 loc-2-3)
    (in key6 loc-4-4)

    (locked c1223 red)
    (locked c2223 red)
    (locked c3223 red)
    (locked c1323 red)
    (locked c2333 red)
    (locked c2314 red)
    (locked c2324 red)
    (locked c2334 red)
    (locked c2425 purple)
    (locked c2535 green)
    (locked c3545 purple)
    (locked c4544 green)
    (locked c4443 rainbow)

    (risky c1223)
    (risky c2223)
    (risky c3223)
    (risky c1323)
    (risky c2333)
    (risky c2314)
    (risky c2324)
    (risky c2334)

    (arm-free)

    (key-colour key1 red)
    (key-colour key2 green)
    (key-colour key3 green)
    (key-colour key4 purple)
    (key-colour key5 purple)
    (key-colour key6 rainbow)

    (one-use key2)
    (one-use key3)
    (one-use key4)
    (one-use key5)
  )
  (:goal
    (and (hero-at loc-4-3))
  )

)

; plan
1. (pick-up loc-2-1 key1)
   deleted: (in key1 loc-2-1) (arm-free)
   added: (holding key1)
   goals met: 0 of 1
2. (move loc-2-1 loc-2-2 c2122)
   deleted: (hero-at loc-2-1)
   added: (hero-at loc-2-2)
   goals met: 0 of 1
3. (move loc-2-2 loc-1-2 c1222)
   deleted: (hero-at loc-2-2)
   added: (hero-at loc-1-2)
   goals met: 0 of 1
4. (unlock loc-1-2 c1223 red key1)
   deleted: (locked c1223 red)
   goals met: 0 of 1
5. (move loc-1-2 loc-1-3 c1213)
   deleted: (hero-at loc-1-2)
   added: (hero-at loc-1-3)
   goals met: 0 of 1
6. (move loc-1-3 loc-1-4 c1314)
   deleted: (hero-at loc-1-3)
   added: (hero-at loc-1-4)
   goals met: 0 of 1
7. (unlock loc-1-4 c2314 red key1)
   deleted: (locked c2314 red)
   goals met: 0 of 1
8. (move loc-1-4 loc-2-3 c2314)
   deleted: (hero-at loc-1-4) (connected loc-1-4 c2314) (connected loc-2-3 c2314)
   added: (hero-at loc-2-3) (messy loc-2-3)
   goals met: 0 of 1
9. (unlock loc-2-3 c2324 red key1)
   deleted: (locked c2324 red)
   goals met: 0 of 1
10. (clean loc-2-3)
   deleted: (messy loc-2-3)
   goals met: 0 of 1
11. (drop loc-2-3 key1)
   deleted: (holding key1)
   added: (in key1 loc-2-3) (arm-free)
   goals met: 0 of 1
12. (pick-up loc-2-3 key4)
   deleted: (in key4 loc-2-3) (arm-free)
   added: (holding key4)
   goals met: 0 of 1
13. (move loc-2-3 loc-2-4 c2324)
   deleted: (hero-at loc-2-3) (connected loc-2-3 c2324) (connected loc-2-4 c2324)
   added: (hero-at loc-2-4) (messy loc-2-4)
   goals met: 0 of 1
14. (unlock loc-2-4 c2425 purple key4)
   deleted: (locked c2425 purple) (one-use key4)
   added: (no-use key4)
   goals met: 0 of 1
15. (move loc-2-4 loc-2-5 c2425)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
16. (drop loc-2-5 key4)
   deleted: (holding key4)
   added: (in key4 loc-2-5) (arm-free)
   goals met: 0 of 1
17. (move loc-2-5 loc-2-4 c2425)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
18. (move loc-2-4 loc-1-4 c1424)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-1-4)
   goals met: 0 of 1
19. (move loc-1-4 loc-1-3 c1314)
   deleted: (hero-at loc-1-4)
   added: (hero-at loc-1-3)
   goals met: 0 of 1
20. (move loc-1-3 loc-1-2 c1213)
   deleted: (hero-at loc-1-3)
   added: (hero-at loc-1-2)
   goals met: 0 of 1
21. (move loc-1-2 loc-2-3 c1223)
   deleted: (hero-at loc-1-2) (connected loc-1-2 c1223) (connected loc-2-3 c1223)
   added: (hero-at loc-2-3) (messy loc-2-3)
   goals met: 0 of 1
22. (clean loc-2-3)
   deleted: (messy loc-2-3)
   goals met: 0 of 1
23. (pick-up loc-2-3 key1)
   deleted: (in key1 loc-2-3) (arm-free)
   added: (holding key1)
   goals met: 0 of 1
24. (unlock loc-2-3 c2334 red key1)
   deleted: (locked c2334 red)
   goals met: 0 of 1
25. (unlock loc-2-3 c1323 red key1)
   deleted: (locked c1323 red)
   goals met: 0 of 1
26. (drop loc-2-3 key1)
   deleted: (holding key1)
   added: (in key1 loc-2-3) (arm-free)
   goals met: 0 of 1
27. (pick-up loc-2-3 key2)
   deleted: (in key2 loc-2-3) (arm-free)
   added: (holding key2)
   goals met: 0 of 1
28. (move loc-2-3 loc-3-4 c2334)
   deleted: (hero-at loc-2-3) (connected loc-2-3 c2334) (connected loc-3-4 c2334)
   added: (hero-at loc-3-4) (messy loc-3-4)
   goals met: 0 of 1
29. (move loc-3-4 loc-2-4 c2434)
   deleted: (hero-at loc-3-4)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
30. (move loc-2-4 loc-2-5 c2425)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
31. (unlock loc-2-5 c2535 green key2)
   deleted: (locked c2535 green) (one-use key2)
   added: (no-use key2)
   goals met: 0 of 1
32. (move loc-2-5 loc-3-5 c2535)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-3-5)
   goals met: 0 of 1
33. (drop loc-3-5 key2)
   deleted: (holding key2)
   added: (in key2 loc-3-5) (arm-free)
   goals met: 0 of 1
34. (move loc-3-5 loc-2-5 c2535)
   deleted: (hero-at loc-3-5)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
35. (move loc-2-5 loc-2-4 c2425)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
36. (move loc-2-4 loc-1-4 c1424)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-1-4)
   goals met: 0 of 1
37. (move loc-1-4 loc-1-3 c1314)
   deleted: (hero-at loc-1-4)
   added: (hero-at loc-1-3)
   goals met: 0 of 1
38. (move loc-1-3 loc-2-3 c1323)
   deleted: (hero-at loc-1-3) (connected loc-1-3 c1323) (connected loc-2-3 c1323)
   added: (hero-at loc-2-3) (messy loc-2-3)
   goals met: 0 of 1
39. (clean loc-2-3)
   deleted: (messy loc-2-3)
   goals met: 0 of 1
40. (pick-up loc-2-3 key1)
   deleted: (in key1 loc-2-3) (arm-free)
   added: (holding key1)
   goals met: 0 of 1
41. (unlock loc-2-3 c2333 red key1)
   deleted: (locked c2333 red)
   goals met: 0 of 1
42. (unlock loc-2-3 c3223 red key1)
   deleted: (locked c3223 red)
   goals met: 0 of 1
43. (drop loc-2-3 key1)
   deleted: (holding key1)
   added: (in key1 loc-2-3) (arm-free)
   goals met: 0 of 1
44. (pick-up loc-2-3 key5)
   deleted: (in key5 loc-2-3) (arm-free)
   added: (holding key5)
   goals met: 0 of 1
45. (move loc-2-3 loc-3-2 c3223)
   deleted: (hero-at loc-2-3) (connected loc-2-3 c3223) (connected loc-3-2 c3223)
   added: (hero-at loc-3-2) (messy loc-3-2)
   goals met: 0 of 1
46. (move loc-3-2 loc-3-3 c3233)
   deleted: (hero-at loc-3-2)
   added: (hero-at loc-3-3)
   goals met: 0 of 1
47. (move loc-3-3 loc-3-4 c3334)
   deleted: (hero-at loc-3-3)
   added: (hero-at loc-3-4)
   goals met: 0 of 1
48. (move loc-3-4 loc-2-4 c2434)
   deleted: (hero-at loc-3-4)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
49. (move loc-2-4 loc-2-5 c2425)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
50. (move loc-2-5 loc-3-5 c2535)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-3-5)
   goals met: 0 of 1
51. (unlock loc-3-5 c3545 purple key5)
   deleted: (locked c3545 purple) (one-use key5)
   added: (no-use key5)
   goals met: 0 of 1
52. (move loc-3-5 loc-4-5 c3545)
   deleted: (hero-at loc-3-5)
   added: (hero-at loc-4-5)
   goals met: 0 of 1
53. (drop loc-4-5 key5)
   deleted: (holding key5)
   added: (in key5 loc-4-5) (arm-free)
   goals met: 0 of 1
54. (move loc-4-5 loc-3-5 c3545)
   deleted: (hero-at loc-4-5)
   added: (hero-at loc-3-5)
   goals met: 0 of 1
55. (move loc-3-5 loc-2-5 c2535)
   deleted: (hero-at loc-3-5)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
56. (move loc-2-5 loc-2-4 c2425)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
57. (move loc-2-4 loc-3-4 c2434)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-3-4)
   goals met: 0 of 1
58. (move loc-3-4 loc-3-3 c3334)
   deleted: (hero-at loc-3-4)
   added: (hero-at loc-3-3)
   goals met: 0 of 1
59. (move loc-3-3 loc-2-3 c2333)
   deleted: (hero-at loc-3-3) (connected loc-3-3 c2333) (connected loc-2-3 c2333)
   added: (hero-at loc-2-3) (messy loc-2-3)
   goals met: 0 of 1
60. (clean loc-2-3)
   deleted: (messy loc-2-3)
   goals met: 0 of 1
61. (pick-up loc-2-3 key1)
   deleted: (in key1 loc-2-3) (arm-free)
   added: (holding key1)
   goals met: 0 of 1
62. (unlock loc-2-3 c2223 red key1)
   deleted: (locked c2223 red)
   goals met: 0 of 1
63. (drop loc-2-3 key1)
   deleted: (holding key1)
   added: (in key1 loc-2-3) (arm-free)
   goals met: 0 of 1
64. (pick-up loc-2-3 key3)
   deleted: (in key3 loc-2-3) (arm-free)
   added: (holding key3)
   goals met: 0 of 1
65. (move loc-2-3 loc-2-2 c2223)
   deleted: (hero-at loc-2-3) (connected loc-2-3 c2223) (connected loc-2-2 c2223)
   added: (hero-at loc-2-2) (messy loc-2-2)
   goals met: 0 of 1
66. (move loc-2-2 loc-1-2 c1222)
   deleted: (hero-at loc-2-2)
   added: (hero-at loc-1-2)
   goals met: 0 of 1
67. (move loc-1-2 loc-1-3 c1213)
   deleted: (hero-at loc-1-2)
   added: (hero-at loc-1-3)
   goals met: 0 of 1
68. (move loc-1-3 loc-1-4 c1314)
   deleted: (hero-at loc-1-3)
   added: (hero-at loc-1-4)
   goals met: 0 of 1
69. (move loc-1-4 loc-2-4 c1424)
   deleted: (hero-at loc-1-4)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
70. (move loc-2-4 loc-2-5 c2425)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
71. (move loc-2-5 loc-3-5 c2535)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-3-5)
   goals met: 0 of 1
72. (move loc-3-5 loc-4-5 c3545)
   deleted: (hero-at loc-3-5)
   added: (hero-at loc-4-5)
   goals met: 0 of 1
73. (unlock loc-4-5 c4544 green key3)
   deleted: (locked c4544 green) (one-use key3)
   added: (no-use key3)
   goals met: 0 of 1
74. (move loc-4-5 loc-4-4 c4544)
   deleted: (hero-at loc-4-5)
   added: (hero-at loc-4-4)
   goals met: 0 of 1
75. (drop loc-4-4 key3)
   deleted: (holding key3)
   added: (in key3 loc-4-4) (arm-free)
   goals met: 0 of 1
76. (pick-up loc-4-4 key6)
   deleted: (in key6 loc-4-4) (arm-free)
   added: (holding key6)
   goals met: 0 of 1
77. (unlock loc-4-4 c4443 rainbow key6)
   deleted: (locked c4443 rainbow)
   goals met: 0 of 1
78. (move loc-4-4 loc-4-3 c4443)
   deleted: (hero-at loc-4-4)
   added: (hero-at loc-4-3)
   goals met: 1 of 1
